# Homebrew Packages
# Generated: 2026-01-12
#
# This list contains only explicitly installed packages (not dependencies).
# Dependencies will be automatically installed when you install these packages.
#
# To reinstall all packages:
#   brew install $(cat brew-packages.txt | grep -v "^#" | grep -v "^$" | grep -v "^## ")
#
# Or use Homebrew Bundle (recommended):
#   brew bundle dump --file=Brewfile
#   brew bundle install --file=Brewfile

## Formulae (39 packages - explicitly installed, no dependencies)

atuin
awscli
bat
bchunk
cmake
cuetools
direnv
eza
fastfetch
felixkratz/formulae/sketchybar
fzf
gh
git-filter-repo
go
hdf5
jq
lapack
lua
lua-language-server
mac
marksman
mpv
neovim
node
ollama
pipx
poppler
pulumi
r
ripgrep
shntool
terraform
tesseract-lang
tfenv
tokei
uv
wget
zellij
zoxide

## Casks (33 applications)
# Note: Some auto-updating apps (cursor, chrome, teams, slack, vscode, zoom) may occasionally
# conflict with --greedy updates. Docker Desktop required manual sudo intervention (removed from list).
# Accept manual fixes if conflicts occur (~1-2x per year based on experience).

aerospace
cursor
font-arial
font-fira-code-nerd-font
font-hack-nerd-font
font-hasklug-nerd-font
font-jetbrains-mono-nerd-font
font-sf-mono
font-sf-pro
ghostty
google-chrome
helium-browser
iina
karabiner-elements
keepassxc
keymapp
libreoffice
microsoft-auto-update
microsoft-teams
musicbrainz-picard
proton-drive
proton-mail-bridge
proton-pass
protonvpn
raycast
rstudio
sf-symbols
slack
transmission
visual-studio-code
wezterm
zen
zoom
